node {
  name: "input_tensor"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 240
        }
        dim {
          size: 360
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "label_tensor"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 240
        }
        dim {
          size: 360
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "mask_tensor"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 240
        }
        dim {
          size: 360
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "phase"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "train"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "test"
      }
    }
  }
}
node {
  name: "Equal/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "test"
      }
    }
  }
}
node {
  name: "Equal"
  op: "Equal"
  input: "Equal/x"
  input: "Const"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "Const_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "train"
      }
    }
  }
}
node {
  name: "Const_3"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "test"
      }
    }
  }
}
node {
  name: "Equal_1"
  op: "Equal"
  input: "phase"
  input: "Const_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "Const_4"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "train"
      }
    }
  }
}
node {
  name: "Const_5"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "test"
      }
    }
  }
}
node {
  name: "Equal_2"
  op: "Equal"
  input: "phase"
  input: "Const_4"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/Const"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 240
          }
          dim {
            size: 360
          }
          dim {
            size: 1
          }
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/Const_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 240
          }
          dim {
            size: 360
          }
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/Const_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 240
          }
          dim {
            size: 360
          }
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/concat/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/concat"
  op: "ConcatV2"
  input: "input_tensor"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/Const"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/concat/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\004\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2687419354915619
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal"
  op: "Add"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 4
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Assign"
  op: "Assign"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/read"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/Conv2D"
  op: "Conv2D"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/concat"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/block_0_conv_1"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Relu"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/block_0_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Neg"
  op: "Neg"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_0_conv_1/block_0_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Relu_1"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Neg"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/mul/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/mul/x"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Relu_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/sub"
  op: "Sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.285043865442276
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal"
  op: "Add"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Assign"
  op: "Assign"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/read"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/Conv2D"
  op: "Conv2D"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/block_1_conv_1"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Relu"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/block_1_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Neg"
  op: "Neg"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_1/block_1_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Relu_1"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Neg"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/mul/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/mul/x"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Relu_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/sub"
  op: "Sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.285043865442276
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal"
  op: "Add"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Assign"
  op: "Assign"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/read"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/Conv2D"
  op: "Conv2D"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/block_1_conv_2"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Relu"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/block_1_conv_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Neg"
  op: "Neg"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_conv_2/block_1_conv_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Relu_1"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Neg"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/mul/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/mul/x"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Relu_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/sub"
  op: "Sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/mul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/Add"
  op: "Add"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_relu_1/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Relu"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/Add"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Neg"
  op: "Neg"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/Add"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Relu_1"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Neg"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/mul/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/mul/x"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Relu_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/sub"
  op: "Sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/mul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.285043865442276
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal"
  op: "Add"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Assign"
  op: "Assign"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/read"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1_1/Conv2D"
  op: "Conv2D"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_1_add/sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1_1/block_2_conv_1"
  op: "Identity"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1_1/Conv2D"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Relu"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1_1/block_2_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Neg"
  op: "Neg"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_1_1/block_2_conv_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Relu_1"
  op: "Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Neg"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/mul/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/mul/x"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Relu_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/sub"
  op: "Sub"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/Relu"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_3_conv_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.285043865442276
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/TruncatedNormal"
  input: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W"
      }
    }
  }
}
node {
  name: "derain_net_loss/attentive_rnn_loss/attentive_inference/residual_block_1/block_2_conv_2/W/Initializer/truncated_normal"
